export const messages = {
  required: 'Поле обязательно для заполнения',
  login:
    'Логин должен быть от 3 до 36 символов и содержать хотя бы одну латинскую букву. Может содержать цифры и символы "_" или "-"',
  notLogin: 'Неверный формат логина',
  email: 'Email должен быть в формате name@example.com',
  notEmail: 'Неверный формат email',
  password:
    'Пароль должен быть от 5 до 100 символов, содержать только латинские буквы и хотя бы один специальный символ. Может содержать цифры',
  notPassword: 'Неверный формат пароля',
  loginOrEmail: 'Неверный формат логин/email',
  passwordsNotMatch: 'Введенные пароли не совпадают, повторите попытку',
  linkToEmail: 'На вашу почту придёт ссылка для изменения пароля',
  fullName:
    'Поле может содержать только кириллицу, латинские буквы, а также символы " " и "-" длиной не более 100 символов.',
};
